Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortErr Property
 AdjustEdge is too short - continuable error version.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdjustEdgeTooShortErr { get; }
Public Shared ReadOnly Property AdjustEdgeTooShortErr As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdjustEdgeTooShortErr {
	FailureDefinitionId^ get ();
}
static member AdjustEdgeTooShortErr : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace